app/controllers/rooms_controller.rb

    def index
      room = Room.all
---
SELECT "rooms".* FROM "rooms"

    def show
        room = Room.find_by(id: params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        room = Room.find_by(id: params[:id])
        room.update(room_params)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "rooms" SET "payment_token" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["payment_token", "[FILTERED]"], ["updated_at", "2022-12-08 22:02:07.077853"], ["id", 2]]