app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "hehe"], ["created_at", "2022-12-08 11:43:08.680938"], ["updated_at", "2022-12-08 11:43:08.680938"], ["password_digest", "[FILTERED]"]]
---
    def create
      user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def show
        # return render json:{error: "Not authorized"}, status: :unauthorized unless session.include? :user_id
        user = User.find_by(id:session[:user_id])